# Performance Analysis

## Gathering the Necessary Materials

### Dependencies

In [1]:
#importing the needed dependencies
import pandas as pd

### CSV's

In [2]:
#import the csvs
onemin_df = pd.read_csv('../CSVs/scraped/1min.csv')
fourmin_df = pd.read_csv('../CSVs/scraped/4min.csv')
thirtymin_df = pd.read_csv('../CSVs/scraped/30min.csv')
sixtymin_df = pd.read_csv('../CSVs/scraped/60min.csv')
onehun_df = pd.read_csv('../CSVs/scraped/100m.csv')
fivehun_df = pd.read_csv('../CSVs/scraped/500m.csv')
onek_df = pd.read_csv('../CSVs/scraped/1000m.csv')
twok_df = pd.read_csv('../CSVs/scraped/2000m.csv')
fivek_df = pd.read_csv('../CSVs/scraped/5000m.csv')
sixk_df = pd.read_csv('../CSVs/scraped/6000m.csv')
tenk_df = pd.read_csv('../CSVs/scraped/10000m.csv')
halfmarathon_df = pd.read_csv('../CSVs/scraped/HalfMarathon.csv')
marathon_df = pd.read_csv('../CSVs/scraped/Marathon.csv')

### Definging functions

In [3]:
def mintosec (time):
    split = time.split(':')
    if len(split) <= 2:
        return ((int(split[0])*60)+(float(split[1])))
    else:
        return (((int(split[0])*60)*60)+(int(split[1])*60)+(float(split[1])))

In [4]:
def clean_forDistance (df, timeinsec, testname):
    df['Test'] = testname
    df = df[df['Distance'] != 0]
    df['Split'] = df['Distance'].apply(lambda x: round(500*(timeinsec/x),2))
    df['Watts'] = df['Split'].apply(lambda x: round(2.8/(x/500)**3,2))
    df = df.sort_values(by = ['Distance'], ascending=False)
    df = df.reset_index()
    df = df.drop(columns=['Unnamed: 0', 'Pos.', 'Type', 'index'])
    df.to_csv(f'../CSVs/cleaned/{testname}.csv', index = False)
    return df

In [5]:
def clean_forTime (df, distance, testname):
    df['Test'] = testname
    df = df.dropna(subset=['Time'])
    df['Seconds'] = df['Time'].apply(mintosec)
    df['Split'] = df['Seconds'].apply(lambda x: round(500*(x/distance), 2))
    df['Watts'] = df['Split'].apply(lambda x: round(2.8/(x/500)**3,2))
    df.sort_values(by = ['Watts'], ascending=False)
    df = df.drop(columns=['Unnamed: 0', 'Pos.', 'Type'])
    df.to_csv(f'../CSVs/cleaned/{testname}.csv', index = False)
    return df

In [6]:
mintosec('1:13:38.5')

4393.0

## Getting Clean

- Renaming
- Dropping Unnecessary Columns

In [7]:
onemin_clean = clean_forDistance(onemin_df, 60, '1 Minute')
onemin_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Distance,Verified,Season,Test,Split,Watts
0,Phil Clapp,29,NaN,GBR,NaN,431,Yes,2020,1 Minute,69.61,1037.66
1,Loren Howard,34,NaN,USA,NaN,429,Yes,2018,1 Minute,69.93,1023.48
2,Phil Clapp,28,NaN,GBR,NaN,428,Yes,2019,1 Minute,70.09,1016.48
3,Ross Love,33,"Friendswood, TX",USA,NaN,428,Yes,2018,1 Minute,70.09,1016.48
4,Ross Love,31,"Friendswood, TX",USA,NaN,422,Yes,2016,1 Minute,71.09,974.19

In [8]:
fourmin_clean = clean_forDistance(fourmin_df, 240, '4 Minute')
fourmin_clean.head()

<ipython-input-4-91ddc0581fec>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Split'] = df['Distance'].apply(lambda x: round(500*(timeinsec/x),2))
<ipython-input-4-91ddc0581fec>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Watts'] = df['Split'].apply(lambda x: round(2.8/(x/500)**3,2))

,Name,Age,Location,Country,Club/Affiliation,Distance,Verified,Season,Test,Split,Watts
0,Jolie Carlile,14,NaN,USA,NaN,8062,No,2021,4 Minute,14.88,106232.95
1,Catherine Pearson,16,"Arlington, VA",USA,"Yorktown High School - Arlington, Virginia",2300,No,2009,4 Minute,52.17,2464.94
2,Amanda McCulloch,35,"Nashville, TN",USA,CrossFit Hermitage,1914,No,2019,4 Minute,62.70,1419.93
3,Charlie Hewitt,14,Plymouth,GBR,Plymouth Amateur Rowing Club,1500,No,2010,4 Minute,80.00,683.59
4,Dwayne K. Adams,40,"Phoenix, AZ",USA,Free Spirits,1461,No,2005,4 Minute,82.14,631.54

In [9]:
thirtymin_clean = clean_forDistance(thirtymin_df, 1800, '30 Minute')
thirtymin_clean.head()

<ipython-input-4-91ddc0581fec>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Split'] = df['Distance'].apply(lambda x: round(500*(timeinsec/x),2))
<ipython-input-4-91ddc0581fec>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Watts'] = df['Split'].apply(lambda x: round(2.8/(x/500)**3,2))

,Name,Age,Location,Country,Club/Affiliation,Distance,Verified,Season,Test,Split,Watts
0,Violet Victoria,15,NaN,USA,NaN,69996,No,2012,30 Minute,12.86,164567.90
1,Scott Harper,22,"Littleton, CO",USA,NaN,11115,No,2009,30 Minute,80.97,659.32
2,charlotte armstrong,38,skelmersdale,GBR,NaN,10372,No,2012,30 Minute,86.77,535.75
3,Rob McGeown,23,Horsham,GBR,NaN,10300,No,2008,30 Minute,87.38,524.60
4,Mike Shotts,41,"Cody, WY",USA,NaN,10146,No,2012,30 Minute,88.70,501.53

In [10]:
sixtymin_clean = clean_forDistance(sixtymin_df, 3600, '60 Minute')
sixtymin_clean.head()

<ipython-input-4-91ddc0581fec>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Split'] = df['Distance'].apply(lambda x: round(500*(timeinsec/x),2))
<ipython-input-4-91ddc0581fec>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Watts'] = df['Split'].apply(lambda x: round(2.8/(x/500)**3,2))

,Name,Age,Location,Country,Club/Affiliation,Distance,Verified,Season,Test,Split,Watts
0,Eric Murray,29,"Cambridge, New Zealand",NZL,NaN,18728,Yes,2012,60 Minute,96.11,394.24
1,KB Nic,35,Acapulco,MEX,NaN,18508,No,2020,60 Minute,97.26,380.42
2,Benjamin Reuter,30,Kiel,GER,NaN,18283,Race,2018,60 Minute,98.45,366.79
3,George Bridgewater,31,NaN,NZL,NaN,18259,Yes,2015,60 Minute,98.58,365.34
4,Graham Benton,34,London,GBR,MAD Team IRC,18221,Yes,2008,60 Minute,98.79,363.02

In [11]:
onehun_clean = clean_forTime(onehun_df, 100, '100m')
onehun_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Ross Love,30,"Friendswood, TX",USA,NaN,0:13.3,Yes,2016,100m,13.3,66.5,1190.15
1,noel Carey,40,glanmire,IRL,NaN,0:13.6,Yes,2016,100m,13.6,68.0,1113.12
2,Mike Reilly,24,"Varsity House, NJ",USA,NaN,0:13.7,Yes,2016,100m,13.7,68.5,1088.92
3,Jack Anderson,28,"St. Louis, MO",USA,"Project Deliverance, St. Louis, Missouri",0:13.8,Yes,2016,100m,13.8,69.0,1065.42
4,Flavio Garrisi,20,Delft,NED,NaN,0:13.8,No,2016,100m,13.8,69.0,1065.42

In [12]:
fivehun_clean = clean_forTime(fivehun_df, 500, '500m')
fivehun_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Rob Smith,31,Hurstpierpoint,GBR,MAD Team IRC,1:19.0,No,2002,500m,79.0,79.0,709.88
1,Tony Larkman,32,Bath,GBR,MAD Team IRC,1:19.0,No,2002,500m,79.0,79.0,709.88
2,Graham Benton,28,London,GBR,MAD Team IRC,1:19.1,No,2002,500m,79.1,79.1,707.19
3,John Stenard,43,"St. Petersburg, FL",USA,Massachusetts Institute of Technology,1:19.1,Race,2002,500m,79.1,79.1,707.19
4,David King,41,Charlton,GBR,NaN,1:19.3,No,2002,500m,79.3,79.3,701.86

In [13]:
onek_clean = clean_forTime(onek_df, 1000, '1000m')
onek_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Chris Roe,24,Warwick,GBR,NaN,2:55.4,No,2002,1000m,175.4,87.70,518.88
1,David Brown,38,"Sandy, UT",USA,NaN,2:55.4,No,2002,1000m,175.4,87.70,518.88
2,Andrew Benko,33,"Dubuque, IA",USA,NaN,2:55.7,No,2002,1000m,175.7,87.85,516.23
3,John Robinson-White,32,Solihull,GBR,NaN,2:56.8,No,2002,1000m,176.8,88.40,506.65
4,Marko Kovalainen,26,Hyvinkää,FIN,NaN,2:56.9,No,2002,1000m,176.9,88.45,505.80

In [14]:
twok_clean = clean_forTime(twok_df, 2000, '2000m')
twok_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Year,Test,Seconds,Split,Watts
0,Matthias Siejkowski,37,NaN,GER,NaN,5:37.0,Race,2002,2000m,337.0,84.25,585.27
1,Justin Sires,25,Brisbane,AUS,NaN,5:46.7,No,2002,2000m,346.7,86.67,537.60
2,Matthew Pinsent,31,NaN,GBR,Leander Club,5:47.5,Race,2002,2000m,347.5,86.88,533.71
3,James Cracknell,29,NaN,GBR,Leander Club,5:47.6,Race,2002,2000m,347.6,86.90,533.35
4,Chris Grothkopp,22,"Princeton, NJ",USA,NaN,5:49.4,Race,2002,2000m,349.4,87.35,525.15

In [15]:
fivek_clean = clean_forTime(fivek_df, 5000, '5000m')
fivek_clean.head()
# fivek_df.head()

<ipython-input-5-2f435e2a07ea>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Seconds'] = df['Time'].apply(mintosec)
<ipython-input-5-2f435e2a07ea>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Split'] = df['Seconds'].apply(lambda x: round(500*(x/distance), 2))
<ipython-input-5-2f435e2a07ea>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Watts'] = df['Split'].apply(lambda x: round(2.8/(x/500)**3,2))

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Nik Fleming,33,"Milton, Cambridge",GBR,Cambridge Assessment,15:53.1,No,2002,5000m,953.1,95.31,404.25
1,Tony Larkman,32,Bath,GBR,MAD Team IRC,15:53.6,No,2002,5000m,953.6,95.36,403.62
2,shane woods,25,belfast,IRL,NaN,16:24.5,No,2002,5000m,984.5,98.45,366.79
3,Edward Johnson,20,London,GBR,NaN,16:25.6,No,2002,5000m,985.6,98.56,365.57
4,Alain MORETTO,33,VICHY,FRA,NaN,16:35.0,No,2002,5000m,995.0,99.50,355.30

In [16]:
fivek_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180219 entries, 0 to 180218
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        180219 non-null  int64
 1   Pos.              180218 non-null  float64
 2   Name              180198 non-null  object
 3   Age               180219 non-null  int64
 4   Location          152243 non-null  object
 5   Country           180216 non-null  object
 6   Club/Affiliation  58330 non-null   object
 7   Time              180218 non-null  object
 8   Type              180219 non-null  object
 9   Verified          180219 non-null  object
 10  Season            180219 non-null  int64
 11  Test              180219 non-null  object
dtypes: float64(1), int64(3), object(8)
memory usage: 16.5+ MB

In [17]:
sixk_clean = clean_forTime(sixk_df, 6000, '6000m')
sixk_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Craig Law,29,"Ottawa, ON",CAN,NaN,19:08.8,No,2002,6000m,1148.8,95.73,398.95
1,Brett Newlin,19,"Seattle, WA",USA,University of Washington,19:31.1,No,2002,6000m,1171.1,97.59,376.58
2,Ben Rutledge,21,"Vancouver, BC",CAN,University of British Columbia,19:34.2,No,2002,6000m,1174.2,97.85,373.58
3,Kevin Burt,27,"Ottawa, ON",CAN,NaN,19:34.5,No,2002,6000m,1174.5,97.88,373.24
4,greg cobb,20,"philadelphia, PA",USA,NaN,19:45.0,No,2002,6000m,1185.0,98.75,363.46

In [18]:
tenk_clean = clean_forTime(tenk_df, 10000, '10000m')
tenk_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Tony Larkman,32,Bath,GBR,MAD Team IRC,33:10.6,No,2002,10000m,1990.6,99.53,354.98
1,Nik Fleming,33,"Milton, Cambridge",GBR,Cambridge Assessment,33:11.4,No,2002,10000m,1991.4,99.57,354.55
2,Troy Kepper,19,"Tallahassee, FL",USA,NaN,33:53.9,No,2002,10000m,2033.9,101.70,332.74
3,Heikki Tukonen,40,Stockholm,SWE,NaN,33:57.6,No,2002,10000m,2037.6,101.88,330.98
4,Dwayne K. Adams,37,"Phoenix, AZ",USA,Free Spirits,33:58.0,No,2002,10000m,2038.0,101.90,330.78

In [19]:
halfmarathon_clean = clean_forTime(halfmarathon_df, 21097, '21097m')
halfmarathon_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Nik Fleming,33,"Milton, Cambridge",GBR,Cambridge Assessment,1:13:38.5,No,2002,21097m,4393.0,104.11,310.16
1,rod freed,52,"mission viejo, CA",USA,NaN,1:14:26.3,No,2002,21097m,4454.0,105.56,297.56
2,Mark Sutro,46,"Oakland, CA",USA,NaN,1:15:16.0,No,2002,21097m,4515.0,107.01,285.62
3,David Brown,37,"Sandy, UT",USA,NaN,1:15:34.6,No,2002,21097m,4515.0,107.01,285.62
4,Tom Carpenter,42,"Kingston, ON",CAN,NaN,1:15:37.0,No,2002,21097m,4515.0,107.01,285.62

In [20]:
marathon_clean = clean_forTime(marathon_df, 42195, '42195m')
marathon_clean.head()

,Name,Age,Location,Country,Club/Affiliation,Time,Verified,Season,Test,Seconds,Split,Watts
0,Dwayne K. Adams,37,"Phoenix, AZ",USA,Free Spirits,2:33:17.5,No,2002,42195m,9213.0,109.17,269.00
1,Ed Golding,22,"Dallas, TX",USA,NaN,2:33:24.3,No,2002,42195m,9213.0,109.17,269.00
2,Gregory Myhr,31,"Madison, WI",USA,NaN,2:34:43.9,No,2002,42195m,9274.0,109.89,263.75
3,Paul Flack,45,"Annapolis, MD",USA,Annapolis Rowing Club,2:35:57.7,No,2002,42195m,9335.0,110.62,258.56
4,Chris Flanagan,26,Christchurch,NZL,NaN,2:37:31.9,No,2002,42195m,9457.0,112.06,248.72